Revit 2026 API

# ColorWithTransparencySetTransparency Method

---

set transparency

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetTransparency(
	uint transparency
)
```
```vb
Public Sub SetTransparency (
	transparency As UInteger
)
```
```cpp
public:
void SetTransparency(
	unsigned int transparency
)
```
```fsharp
member SetTransparency :
        transparency : uint32 -> unit
```

#### Parameters

transparency UInt32
     transparency

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

#### Reference

ColorWithTransparency Class

Autodesk.Revit.DB Namespace